ubirch/ubirch-kinetis-sdk/SDK_2.1_MK82FN256xxx15/boards/twrk80f150m/usb_examples/usb_device_ccid_smart_card/freertos/smart_card.c
/*
 * If the SOC has USB KHCI dedicated RAM, the RAM memory needs to be clear after
 * the KHCI clock is enabled. When the demo uses USB EHCI IP, the USB KHCI dedicated
 * RAM can not be used and the memory can't be accessed.
 */
#if (defined(FSL_FEATURE_USB_KHCI_USB_RAM) && (FSL_FEATURE_USB_KHCI_USB_RAM > 0U))
#if (defined(FSL_FEATURE_USB_KHCI_USB_RAM_BASE_ADDRESS) && (FSL_FEATURE_USB_KHCI_USB_RAM_BASE_ADDRESS > 0U))
    for (int i = 0; i < FSL_FEATURE_USB_KHCI_USB_RAM; i++)
    {
        ((uint8_t *)FSL_FEATURE_USB_KHCI_USB_RAM_BASE_ADDRESS)[i] = 0x00U;
    }
#endif /* FSL_FEATURE_USB_KHCI_USB_RAM_BASE_ADDRESS */
#endif /* FSL_FEATURE_USB_KHCI_USB_RAM */

    g_UsbDeviceCcidSmartCard.speed = USB_SPEED_FULL;
    g_UsbDeviceCcidSmartCard.attach = 0U;
    g_UsbDeviceCcidSmartCard.deviceHandle = NULL;

    if (kStatus_USB_Success !=
        USB_DeviceClassInit(CONTROLLER_ID, &g_UsbDeviceCcidConfigList, &g_UsbDeviceCcidSmartCard.deviceHandle))
    {
        usb_echo("USB device CCID smart card failed\r\n");
        return;
    }
    else
    {
        usb_echo("USB device CCID smart card demo\r\n");
        g_UsbDeviceCcidSmartCard.classHandle = g_UsbDeviceCcidConfigList.config[0].classHandle;
    }

    NVIC_SetPriority((IRQn_Type)irqNumber, USB_DEVICE_INTERRUPT_PRIORITY);
    NVIC_EnableIRQ((IRQn_Type)irqNumber);

    g_UsbDeviceCcidSmartCard.clockFrequency = USB_DEVICE_CCID_SMART_CARD_DEFAULT_CLOCK;
    g_UsbDeviceCcidSmartCard.dataRate = USB_DEVICE_CCID_SMART_CARD_DATA_RATE;
    g_UsbDeviceCcidSmartCard.clockStatus = USB_DEVICE_CCID_CLCOK_STATUS_CLOCK_STOPPED_UNKNOWN;
    g_UsbDeviceCcidSmartCard.protocol = USB_DEVICE_CCID_PROTOCOL_NUMBER_T0;

    g_UsbDeviceCcidSmartCard.present = 0U;
    g_UsbDeviceCcidSmartCard.powerOn = 0U;

    EMVL1_SmartCardInit(EMVL1_CcidCallback);

    USB_DeviceRun(g_UsbDeviceCcidSmartCard.deviceHandle);
}

#if USB_DEVICE_CONFIG_USE_TASK
void USB_DeviceTask(void *handle)
{
    while (1U)
    {
#if defined(USB_DEVICE_CONFIG_EHCI) && (USB_DEVICE_CONFIG_EHCI > 0U)
        USB_DeviceEhciTaskFunction(handle);
#endif
#if defined(USB_DEVICE_CONFIG_KHCI) && (USB_DEVICE_CONFIG_KHCI > 0U)
        USB_DeviceKhciTaskFunction(handle);
#endif
    }
}
#endif

void APP_task(void *handle)
{
    USB_DeviceApplicationInit();

#if USB_DEVICE_CONFIG_USE_TASK
    if (g_UsbDeviceCcidSmartCard.deviceHandle)
    {
        if (xTaskCreate(USB_DeviceTask,                            /* pointer to the task */
                        "usb device task",                         /* task name for kernel awareness debugging */
                        5000L / sizeof(portSTACK_TYPE),            /* task stack size */
                        g_UsbDeviceCcidSmartCard.deviceHandle,     /* optional task startup argument */
                        5U,                                        /* initial priority */
                        &g_UsbDeviceCcidSmartCard.deviceTaskHandle /* optional task handle to create */
                        ) != pdPASS)
        {
            usb_echo("usb device task create failed!\r\n");
            return;
        }
    }
#endif

    if (xTaskCreate(EMVL1_StartCardTask,                          /* pointer to the task */
                    "smart card task",                            /* task name for kernel awareness debugging */
                    2000L / sizeof(portSTACK_TYPE),               /* task stack size */
                    NULL,                                         /* optional task startup argument */
                    6U,                                           /* initial priority */
                    &g_UsbDeviceCcidSmartCard.smartCardTaskHandle /* optional task handle to create */
                    ) != pdPASS)
    {
        usb_echo("emvl1 smart card task create failed!\r\n");
        return;
    }

    while (1U)
    {
        vTaskDelay(MSEC_TO_TICK(1U));
    }
}

#if defined(__CC_ARM) || defined(__GNUC__)
int main(void)
#else
void main(void)
#endif
{
    BOARD_InitPins();
    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();
    /* Un-gate RTC for EMVSIM functionality */
    CLOCK_EnableClock(kCLOCK_Rtc0);
    /* Enable 32.768 kHz oscillator */
    RTC->CR |= RTC_CR_OSCE_MASK;
    /* Initialize pin interrupt */
    PORT_SetPinInterruptConfig(PORTA, BOARD_SMARTCARD_IRQ_PIN, kPORT_InterruptEitherEdge);
    /* Clear interrupt status flags */
    PORT_ClearPinsInterruptFlags(PORTA, 1u << BOARD_SMARTCARD_IRQ_PIN);

    if (xTaskCreate(APP_task,                                       /* pointer to the task */
                    "app task",                                     /* task name for kernel awareness debugging */
                    5000L / sizeof(portSTACK_TYPE),                 /* task stack size */
                    &g_UsbDeviceCcidSmartCard,                      /* optional task startup argument */
                    4U,                                             /* initial priority */
                    &g_UsbDeviceCcidSmartCard.applicationTaskHandle /* optional task handle to create */
                    ) != pdPASS)
    {
        usb_echo("app task create failed!\r\n");
#if (defined(__CC_ARM) || defined(__GNUC__))
        return 1U;
#else
        return;
#endif
    }

    vTaskStartScheduler();

#if (defined(__CC_ARM) || defined(__GNUC__))
    return 1U;
#endif
}
